#3. Вывести на экран числа от -N до N

N = int(input('введите N: '))
count = int(-N)

while (count < N+1):

  print(count)
  count+=1

