#Вывести на экран числа от -N до N

print('введите N')
N = int(input())
count = int(-N)

while (count < N+1):

  print(count)
  count+=1

