# Реализовать алгоритм перемешивания списка. 

import random


listA = [2, 8, 4, 31, 1, 15] 
random.shuffle(listA)
print(listA)