# Дано число. Проверить кратно ли оно 7 и 23

a = int(input('Введите число a: '))
if(a % 7 == 0):
    print(f'{a} кратно 7')
else:
    print(f'{a} НЕ кратно 7')
if(a % 23 == 0):
    print(f'{a} кратно 23')
else:
     print(f'{a} НЕ кратно 23')