#Даны два числа. Показать большее и меньшее число

a = int(input('Введите a: '))
b = int(input('Введите b: '))
if a>b:
    print(f'{a} больше {b} ')
else:
    print(f'{b} больше {a} ')
    
